---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireSetIterator
source: html/e3dedb9f-6ba0-1771-9fe0-265707df43f3.htm
---
# WireSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.